# Indexes

In [5]:
people = {
    "Name" : ["Jafar","Surya","Vikram"],
    "No"   : [10,20,30],
    "Mail" : ["shaikmohammadhussain999@gmail.com","Surya@gmail.com","Vikram@gmail.com"]
}

In [6]:
import pandas as pd

In [7]:
df = pd.DataFrame(people)

In [9]:
df

     Name  No                               Mail
0   Jafar  10  shaikmohammadhussain999@gmail.com
1   Surya  20                    Surya@gmail.com
2  Vikram  30                   Vikram@gmail.com

# Let set the custom index

In [10]:
df.set_index('Mail')

                                     Name  No
Mail
shaikmohammadhussain999@gmail.com   Jafar  10
Surya@gmail.com                     Surya  20
Vikram@gmail.com                   Vikram  30

In [12]:
df

     Name  No                               Mail
0   Jafar  10  shaikmohammadhussain999@gmail.com
1   Surya  20                    Surya@gmail.com
2  Vikram  30                   Vikram@gmail.com

In [13]:
df.set_index('Mail',inplace=True)

In [14]:
df

                                     Name  No
Mail
shaikmohammadhussain999@gmail.com   Jafar  10
Surya@gmail.com                     Surya  20
Vikram@gmail.com                   Vikram  30

In [15]:
#inplace is successufl save the modified one

In [20]:
df.loc['shaikmohammadhussain999@gmail.com','Name']

'Jafar'

In [21]:
df

                                     Name  No
Mail
shaikmohammadhussain999@gmail.com   Jafar  10
Surya@gmail.com                     Surya  20
Vikram@gmail.com                   Vikram  30

In [24]:
df.reset_index(inplace=True) #it reset the index and save to df

In [25]:
df

   index                               Mail    Name  No
0      0  shaikmohammadhussain999@gmail.com   Jafar  10
1      1                    Surya@gmail.com   Surya  20
2      2                   Vikram@gmail.com  Vikram  30